## Work Directory: `terraform`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_storage_bucket.sample_bucket: Refreshing state... [id=terraform-repository-template-sample-bucket]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_storage_bucket.sample_bucket has changed
  ~ resource "google_storage_bucket" "sample_bucket" {
        id                          = "terraform-repository-template-sample-bucket"
      + labels                      = {}
        name                        = "terraform-repository-template-sample-bucket"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.sample_bucket must be replaced
-/+ resource "google_storage_bucket" "sample_bucket" {
      - default_event_based_hold    = false -> null
      ~ id                          = "terraform-repository-template-sample-bucket" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "terraform-repository-template-sample-bucket" -> "terraform-repository-template-sample-bucket-2" # forces replacement
      ~ project                     = "terraform-sandbox-342901" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/terraform-repository-template-sample-bucket" -> (known after apply)
      ~ url                         = "gs://terraform-repository-template-sample-bucket" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>